package controller;

import java.util.Set;

/**
 * Το interface αυτό καθορίζει τις μεθόδους που πρέπει να υλοποιούν οι κλάσεις
 * που θα χειρίζονται το ιστορικό καταγραφής.
 * 
 * @author team1
 * 
 */
public interface History {

    /**
     * Η συνάρτηση διαβάζει το ιστορικό που βρίσκεται σε μια βάση, ένα rdf
     * αρχείο, αρχείο κειμένου ή ότι έχει επιλέξει η υλοποίηση και επιστρέφει
     * μια λίστα από String. Κάθε String αντιπροσωπεύει μια εγγραφή με τα
     * στοιχεία της χωρισμένα με κόμμα.
     * 
     * @return λίστα με String. Κάθε String αντιστοιχεί σε μια εγγραφή.
     */
    public abstract Set<String> getHistory();

    /**
     * Εισάγει μία εγγραφή με τα ορίσματα στη δομή.
     * 
     */
    public abstract void addRecord(String data, int value);
    
    /**
     * Κάνει την εγγραφή στο αρχείο. Οι πληροφορίες κρατούνται στην μνήμη
     * και γράφονται μόνο με την κλήση αυτής της συνάρτησης.
     */
    public abstract void commit();

}
